samuelpoiraud/robot/STM32/QS/QS_rx24.c
/*
 *	Club Robot ESEO 2010 - 2013
 *	???
 *
 *	Fichier : QS_rx24.h
 *	Package : Qualite Software
 *	Description : Module de gestion des servomoteurs Dynamixel RX24/RX24+
 *	Auteur : Ronan, Jacen, modifié et complété par Alexis (2012-2013)
 *	Licence : CeCILL-C (voir LICENCE.txt)
 *	Version 20121110
 */

//Pour voir l'ancienne version avant les modifications faites pour le robot 2012-2013, utilisez la version SVN 5340

#include "QS_rx24.h"

#ifdef USE_RX24_SERVO

#include "QS_ports.h"
#include "QS_outputlog.h"
#include "stm32f4xx_usart.h"

#include "../config/config_pin.h"


	/**********************************************************************/
	/** Paramètres de configuration du driver RX24/RX24                        */
	/**********************************************************************/

	#if !defined(RX24_NUMBER) || RX24_NUMBER > 254
		#error "Vous devez definir un nombre de servo sur le robot (RX24_NUMBER) (254 max)"
	#endif /* ndef RX24_NUMBER */

	//#define RX24_DEBUG_PACKETS: si défini, les paquets envoyés sont écrits sur la sortie uart en utilisant debug_printf (attention, debug_printf n'est pas réentrante)

//	#ifndef RX24_UART_ID
//		#define RX24_UART_ID 2
//	#endif



	#if RX24_UART_ID == 1
		#define RX24_UART_Ptr USART1
		#define RX24_UART_Interrupt USART1_IRQHandler
		#define RX24_UART_Interrupt_IRQn USART1_IRQn
	#elif RX24_UART_ID == 2
		#define RX24_UART_Ptr USART2
		#define RX24_UART_Interrupt USART2_IRQHandler
		#define RX24_UART_Interrupt_IRQn USART2_IRQn
	#elif RX24_UART_ID == 3
		#define RX24_UART_Ptr USART3
		#define RX24_UART_Interrupt USART3_IRQHandler
		#define RX24_UART_Interrupt_IRQn USART3_IRQn
	#else
	#warning "RX24: Unknown UART ID"
	#endif

	#ifndef RX24_UART_BAUDRATE
		#define RX24_UART_BAUDRATE  56700
	#endif

	#ifndef RX24_STATUS_RETURN_TIMEOUT
		#define RX24_STATUS_RETURN_TIMEOUT 50	//Ne pas mettre une valeur trop proche de celle prévue, l'RX24/RX24 répond parfois avec un delai plus long
	#endif

	#ifndef RX24_STATUS_SEND_TIMEOUT
		#define RX24_STATUS_SEND_TIMEOUT 10
	#endif

	#ifndef RX24_STATUS_RETURN_MODE
		#define RX24_STATUS_RETURN_MODE RX24_STATUS_RETURN_ONREAD
	#endif

	#ifndef RX24_INSTRUCTION_BUFFER_SIZE
		#define RX24_INSTRUCTION_BUFFER_SIZE (5*RX24_NUMBER)
	#endif

	/**********************************************************************/
	/** Configuration du timer pour le timeout de réception du status    **/
	/**********************************************************************/

	#ifdef RX24_TIMER_ID
		#define TIMER_SRC_TIMER_ID RX24_TIMER_ID
	#endif
	#ifdef RX24_TIMER_USE_WATCHDOG
		#define TIMER_SRC_USE_WATCHDOG
	#endif

	#include "QS_setTimerSource.h"

	/*************************************************************************************/

	/* UART2 exclusivement dédié à la gestion des servomoteurs AX-12+ */

	#ifdef USE_UART2
		#error "Vous ne pouvez pas utiliser l'UART2 et l'RX24 en même temps, l'RX24 à besoin de l'UART2 pour communiquer"
	#endif

	#if (!defined(RX24_DIRECTION_PORT_RX24))
		#error "Vous devez definir un port de direction (RX24_DIRECTION_PORT_RX24) pour gérer l'UART qui est en Half-duplex (cf. Datasheet MAX485)"
	#endif /* ndef RX24_DIRECTION_PORT */

	/* Pour UART half-uplex */
	#define TX_DIRECTION 1
	#define RX_DIRECTION 0


	/*************************************************************************************/
	/** Constantes liées au instruction envoyées a l'RX24/RX24                               **/
	/*************************************************************************************/

	/* Instructions */

	#define INST_PING 				0x01
	#define INST_READ 				0x02
	#define INST_WRITE 				0x03
	#define INST_REG_WRITE 			0x04
	#define INST_ACTION 			0x05
	//Instructions non utilisées
	//#define INST_RESET 			0x06
	//#define INST_DIGITAL_RESET 	0x07
	//#define INST_SYSTEM_READ 		0x0C
	//#define INST_SYSTEM_WRITE 	0x0D
	//#define INST_SYNC_WRITE 		0x83
	//#define INST_SYNC_REG_WRITE 	0x84

	// Adresses de la mémoire interne de l'RX24
	#define RX24_MEM_SIZE		0x32

	#define RX24_MIN_VALUE_0	0x00
	#define RX24_MIN_VALUE_1	0x01
	#define RX24_MIN_VALUE_34	0x02
	#define RX24_MIN_VALUE_50	0x03

	#define RX24_MAX_VALUE_1	0x70
	#define RX24_MAX_VALUE_2	0x60
	#define RX24_MAX_VALUE_127	0x50
	#define RX24_MAX_VALUE_150	0x40
	#define RX24_MAX_VALUE_250	0x30
	#define RX24_MAX_VALUE_253	0x20
	#define RX24_MAX_VALUE_254	0x10
	#define RX24_MAX_VALUE_1023	0x00

	//Les defines sont globaux, il sont défini en même temps que le tableau des valeurs accepté par l'RX24/RX24 pour pouvoir voir à quelle valeur les limites correspondent
	static const Uint8 RX24_values_ranges[0x32] = {
		//EEPROM, utilisé par les fonctions RX24_config_*, les valeurs persiste après une mise hors tension.
		#define RX24_MODEL_NUMBER_L 			0x00
			0,	//non utilisé
		#define RX24_MODEL_NUMBER_H				0x01
			0,	//non utilisé
		#define RX24_VERSION					0x02
			0,	//non utilisé
		#define RX24_ID 						0x03
			RX24_MIN_VALUE_0 | RX24_MAX_VALUE_253,
		#define RX24_BAUD_RATE					0x04
			RX24_MIN_VALUE_34 | RX24_MAX_VALUE_254,	//la limite de l'RX24/RX24 est 0-254, mais la carte ne supporte pas des vitesses supérieures à 56700bauds.
		#define RX24_RETURN_DELAY_TIME			0x05
			RX24_MIN_VALUE_0 | RX24_MAX_VALUE_254,	//Maximum de 508 us
		#define RX24_CW_ANGLE_LIMIT_L			0x06
			RX24_MIN_VALUE_0 | RX24_MAX_VALUE_1023,
		#define RX24_CW_ANGLE_LIMIT_H			0x07
			RX24_MIN_VALUE_0 | RX24_MAX_VALUE_254,	//ne devrait pas être utilisé
		#define RX24_CCW_ANGLE_LIMIT_L			0x08
			RX24_MIN_VALUE_0 | RX24_MAX_VALUE_1023,
		#define RX24_CCW_ANGLE_LIMIT_H			0x09
			RX24_MIN_VALUE_0 | RX24_MAX_VALUE_254,	//ne devrait pas être utilisé
		#define RX24_SYSTEM_DATA2				0x0A
			0,	//non utilisé
		#define RX24_LIMIT_TEMPERATURE			0x0B
			RX24_MIN_VALUE_0 | RX24_MAX_VALUE_150,
		#define RX24_DOWN_LIMIT_VOLTAGE 		0x0C
			RX24_MIN_VALUE_50 | RX24_MAX_VALUE_250,
		#define RX24_UP_LIMIT_VOLTAGE			0x0D
			RX24_MIN_VALUE_50 | RX24_MAX_VALUE_250,
		#define RX24_MAX_TORQUE_L				0x0E
			RX24_MIN_VALUE_0 | RX24_MAX_VALUE_1023,
		#define RX24_MAX_TORQUE_H				0x0F
			RX24_MIN_VALUE_0 | RX24_MAX_VALUE_254,	//ne devrait pas être utilisé
		#define RX24_RETURN_LEVEL				0x10
			RX24_MIN_VALUE_0 | RX24_MAX_VALUE_2,
		#define RX24_ALARM_LED					0x11
			RX24_MIN_VALUE_0 | RX24_MAX_VALUE_127,
		#define RX24_ALARM_SHUTDOWN 			0x12
			RX24_MIN_VALUE_0 | RX24_MAX_VALUE_127,
		#define RX24_OPERATING_MODE 			0x13
			RX24_MIN_VALUE_0 | RX24_MAX_VALUE_1,
		#define RX24_DOWN_CALIBRATION_L 		0x14
			0,	//non utilisé
		#define RX24_DOWN_CALIBRATION_H 		0x15
			0,	//non utilisé
		#define RX24_UP_CALIBRATION_L			0x16
			0,	//non utilisé
		#define RX24_UP_CALIBRATION_H			0x17
			0,	//non utilisé

		//RAM de l'RX24, reinitialisé après une mise hors tension
		#define RX24_TORQUE_ENABLE				0x18
			RX24_MIN_VALUE_0 | RX24_MAX_VALUE_1,
		#define RX24_LED						0x19
			RX24_MIN_VALUE_0 | RX24_MAX_VALUE_1,
		#define RX24_CW_COMPLIANCE_MARGIN		0x1A
			RX24_MIN_VALUE_0 | RX24_MAX_VALUE_254,
		#define RX24_CCW_COMPLIANCE_MARGIN		0x1B
			RX24_MIN_VALUE_0 | RX24_MAX_VALUE_254,
		#define RX24_CW_COMPLIANCE_SLOPE		0x1C
			RX24_MIN_VALUE_1 | RX24_MAX_VALUE_254,
		#define RX24_CCW_COMPLIANCE_SLOPE		0x1D
			RX24_MIN_VALUE_1 | RX24_MAX_VALUE_254,
		#define RX24_GOAL_POSITION_L			0x1E
			RX24_MIN_VALUE_0 | RX24_MAX_VALUE_1023,
		#define RX24_GOAL_POSITION_H			0x1F
			RX24_MIN_VALUE_0 | RX24_MAX_VALUE_254,	//ne devrait pas être utilisé
		#define RX24_GOAL_SPEED_L				0x20
			RX24_MIN_VALUE_0 | RX24_MAX_VALUE_1023,
		#define RX24_GOAL_SPEED_H				0x21
			RX24_MIN_VALUE_0 | RX24_MAX_VALUE_254,	//ne devrait pas être utilisé
		#define RX24_TORQUE_LIMIT_L				0x22
			RX24_MIN_VALUE_0 | RX24_MAX_VALUE_1023,
		#define RX24_TORQUE_LIMIT_H 			0x23
			RX24_MIN_VALUE_0 | RX24_MAX_VALUE_254,	//ne devrait pas être utilisé
		#define RX24_PRESENT_POSITION_L 		0x24
			0,	//non utilisé
		#define RX24_PRESENT_POSITION_H 		0x25
			0,	//non utilisé
		#define RX24_PRESENT_SPEED_L			0x26
			0,	//non utilisé
		#define RX24_PRESENT_SPEED_H			0x27
			0,	//non utilisé
		#define RX24_PRESENT_LOAD_L 			0x28
			0,	//non utilisé
		#define RX24_PRESENT_LOAD_H 			0x29
			0,	//non utilisé
		#define RX24_PRESENT_VOLTAGE			0x2A
			0,	//non utilisé
		#define RX24_PRESENT_TEMPERATURE		0x2B
			0,	//non utilisé
		#define RX24_REGISTERED_INSTRUCTION		0x2C
			0,	//non utilisé
		#define RX24_PAUSE_TIME 				0x2D
			0,	//non utilisé
		#define RX24_MOVING 					0x2E
			0,	//non utilisé
		#define RX24_LOCK						0x2F
			RX24_MIN_VALUE_0 | RX24_MAX_VALUE_1,
		#define RX24_PUNCH_L					0x30
			RX24_MIN_VALUE_0 | RX24_MAX_VALUE_1023,
		#define RX24_PUNCH_H					0x31
			RX24_MIN_VALUE_0 | RX24_MAX_VALUE_254	//ne devrait pas être utilisé
	};

	//Adresse spéciale pour le ping
	#define RX24_PING 0xFF

	/***********************************************************************/
	/** Autre définitions internes                                        **/
	/***********************************************************************/

	//Si défini, on teste le checksum des paquets de status, si le resultat est incorrect, le paquet est ignoré
	//#define RX24_STATUS_RETURN_CHECK_CHECKSUM

	//nous avons besoin d'une place en plus pour pouvoir différencier le cas ou le buffer est vide du cas ou il est plein
	#define RX24_INSTRUCTION_REAL_NEEDED_BUFFER_SIZE (RX24_INSTRUCTION_BUFFER_SIZE+1)

