samuelpoiraud/robot/STM32/QS/QS_rx24.c
	#define MIN_INSTRUCTION_PACKET_SIZE 6
	#define MAX_STATUS_PACKET_SIZE 8

	//Macro pour simplifier l'incrementation d'index (la fonction modulo fait une division assez lourde, donc profitons de super-macro
	//le modulo (%) c'est bien, mais c'est aussi beaucoup d'opération pour les cas utilisés (les valeurs ne doivent jamais dépasser 2*div)
	#define INC_WITH_MOD(val,div) (( (val)+1 < div )? (val)+1 : 0)

	/***********************************************************************/

typedef struct{
	volatile RX24_status_t last_status;
	Uint16 angle_limit[2];	//sauvegarde des angles limites lors d'un passage en mode wheel (rotation complète en continue) Si l'RX24/RX24 était déja dans ce mode, les angles limites défini à 0°-300°.
	bool_e is_wheel_enabled;
	// Possibilité d'ajout de membres ...
} RX24_servo_t;

//Paquet instruction a envoyer a l'RX24
typedef struct{
	Uint8 id_servo;
	Uint8 type;
	Uint8 address;
	union {
		Uint16 param;
		struct {
			Uint8 param_1;	//poids fort
			Uint8 param_2;	//poids faible
		};
	};
	Uint8 size;
} RX24_instruction_packet_t;


//Paquet renvoyé par l'RX24, 2 paramètres 8bits maximum
typedef struct{
	Uint8 id_servo;
	Uint16 error;  // l'RX24/RX24 n'utilise que 8 bits
	union {
		Uint16 param;
		struct {
			Uint8 param_1;	//poids fort
			Uint8 param_2;	//poids faible
		};
	};
	Uint8 size;
} RX24_status_packet_t;

typedef struct{
	RX24_instruction_packet_t buffer[RX24_INSTRUCTION_REAL_NEEDED_BUFFER_SIZE];
	Uint8 start_index;
	Uint8 end_index;
} RX24_instruction_buffer;


//Machine à états

// Raison d'appel de la fonction de la machine à états
typedef enum {
	RX24_SME_NoEvent,
	RX24_SME_RxInterrupt,
	RX24_SME_TxInterruptRX24,
	RX24_SME_Timeout
} RX24_state_machine_event_e;

// Etat de la machine à états
typedef enum {
	RX24_SMS_ReadyToSend = 0,
	RX24_SMS_Sending,
	RX24_SMS_WaitingAnswer
} RX24_state_machine_state_e;


typedef struct {
	volatile RX24_state_machine_state_e state;
	volatile Uint16 timeout_counter;	//compteur décrémenté par le timer lorsque que l'état est RX24_SMS_WaitingAnswer

	RX24_instruction_packet_t current_instruction;

	Uint8 receive_index;

	//Utilisé en mode SEND

#ifdef RX24_UART_Ptr
	Uint8 rx24_sending_index;
#endif
} RX24_state_machine_t;

/*************************************************************************************/

// Variables globales, toutes les variables sont intialisée a zero, il n'y a pas de {0} ou autre pour eviter les warnings (avec -Wall) et c'est plus simple et pratique de rien mettre que des {{{0}},{0,0},0} et pour eviter d'avoir des warnings car les warnings c'est mal (défini dans l'ainsi C)

static RX24_servo_t RX24_on_the_robot[RX24_NUMBER];	//Tableau de structure contenant les informations liées à chaque RX24
static RX24_state_machine_t state_machine = {0};	//Machine à états du driver

//Queue contenant les instructions demandée (ce buffer est géré pas les fonctions/macro RX24_instruction_*, il n'y a qu'un buffer pour tous les RX24)
static volatile RX24_instruction_buffer RX24_special_instruction_buffer;
//Cette variable est à TRUE si le driver est en mode préparation de commandes. Voir doc de RX24_start_command_block dans le .h
static bool_e RX24_prepare_commands = FALSE;

/**************************************************************************/
/** Fonctions internes au driver de l'RX24+ et macros                    **/
/**************************************************************************/

static inline Uint16 RX24_decode_value_range(Uint8 mem_addr, bool_e get_max);	//get_max = 1 pour récupérer la valeur max pour une adresse donnée, get_max = 0 pour récupérer le minimum
static Uint8 RX24_instruction_packet_calc_checksum(RX24_instruction_packet_t* instruction_packet);
static Uint8 RX24_get_instruction_packet(Uint8 byte_offset, RX24_instruction_packet_t* instruction_packet);				//Renvoi l'octet d'une instruction a envoyer
#ifdef RX24_STATUS_RETURN_CHECK_CHECKSUM
static Uint8 RX24_status_packet_calc_checksum(RX24_status_packet_t* status_packet);
#endif
static bool_e RX24_update_status_packet(Uint8 receive_byte, Uint8 byte_offset, RX24_status_packet_t* status_packet);	//retourne FALSE si le paquet est non valide, sinon TRUE
static void RX24_state_machine(RX24_state_machine_event_e event);
static void RX24_UART_init_all(Uint32 uart_speed);
static void RX24_UART_init(USART_TypeDef* uartPtr, Uint16 baudrate);
static void RX24_UART_DisableIRQ();
static void RX24_UART_EnableIRQ();
static void RX24_UART_putc(Uint8 c);
static Uint8 RX24_UART_getc();
static bool_e RX24_UART_GetFlagStatus(Uint16 flag);
static void RX24_UART_ITConfig(Uint16 flag, FunctionalState enable);

/**************************************************************************/
/** Fonctions/macro gérant les instructions et le buffer d'instruction   **/
/**************************************************************************/

/*
 * Les fonctions RX24_instruction_async_* sont asynchrones, utiliser RX24_instruction_wait pour attendre la fin de leurs exécutions avant RX24_instruction_get_last_status
 * Attention, ces fonctions attente que de la place se libère dans le buffer interne, attention lors de l'utilisation des fonctions de l'RX24 dans des interruptions
 * Pour prévenir le problème, vous pouvez utiliser RX24_instruction_buffer_is_full() ou changer la priorité de votre interruption
 * L'interruption de l'UART de l'RX24 a pour priorité 5 (pour Tx et Rx) (Si aucun changement n'est fait, l'IT d'un timer a une priorité de 4 comme la majeure partie des ITs)
 */

//Vous ne pouvez pas utiliser la fonction "RX24_instruction_*read" si le mode de retour d'information est RX24_STATUS_RETURN_NEVER

#if RX24_STATUS_RETURN_MODE != RX24_STATUS_RETURN_NEVER
	static bool_e RX24_instruction_async_read(Uint8 id_servo, Uint8 address, Uint8 length);
	static Uint16 RX24_instruction_read16(Uint8 id_servo, Uint8 address, bool_e *isOk);
	static Uint8  RX24_instruction_read8(Uint8 id_servo, Uint8 address, bool_e *isOk);
#endif

static bool_e RX24_instruction_write8(Uint8 id_servo, Uint8 address, Uint8 value);
static bool_e RX24_instruction_write16(Uint8 id_servo, Uint8 address, Uint16 value);
static bool_e RX24_instruction_async_write8(Uint8 id_servo, Uint8 address, Uint8 value);
static bool_e RX24_instruction_async_write16(Uint8 id_servo, Uint8 address, Uint16 value);
static bool_e RX24_instruction_async_ping(Uint8 id_servo);
static bool_e RX24_instruction_async_prepare_write8(Uint8 id_servo, Uint8 address, Uint8 value);
static bool_e RX24_instruction_async_prepare_write16(Uint8 id_servo, Uint8 address, Uint16 value);
static bool_e RX24_instruction_async_execute_write();
static bool_e RX24_instruction_ping(Uint8 id_servo);
static bool_e RX24_instruction_wait(Uint8 id_servo);
static bool_e RX24_instruction_buffer_is_full();
static void RX24_instruction_next(Uint16 error, Uint16 param);
static RX24_status_t RX24_instruction_get_last_status(Uint8 id_servo);
static void RX24_instruction_reset_last_status(Uint8 id_servo);

static bool_e RX24_instruction_queue_insert(const RX24_instruction_packet_t* inst);
#define RX24_status_packet_is_full(status_packet, bytes_received) (((bytes_received) >= 4) && ((bytes_received) >= status_packet.size))	//on doit avoir lu la taille du paquet (>= 4) et avoir lu tous les octets du paquet
#define RX24_instruction_queue_is_full() (INC_WITH_MOD(RX24_special_instruction_buffer.end_index, RX24_INSTRUCTION_REAL_NEEDED_BUFFER_SIZE) == RX24_special_instruction_buffer.start_index)	//buffer plein si le prochain index de fin est l'index de début du buffer
#define RX24_instruction_queue_is_empty() (RX24_special_instruction_buffer.end_index == RX24_special_instruction_buffer.start_index)
#define RX24_instruction_queue_next() \
	(RX24_special_instruction_buffer.start_index = INC_WITH_MOD(RX24_special_instruction_buffer.start_index, RX24_INSTRUCTION_REAL_NEEDED_BUFFER_SIZE))
#define RX24_instruction_queue_get_current() \
	RX24_special_instruction_buffer.buffer[RX24_special_instruction_buffer.start_index]


//retourne TRUE si l'instruction est suivie d'une réponse de l'RX24
//inst est de type RX24_instruction_packet_t
#define RX24_instruction_has_status_packet(inst) (inst.id_servo != RX24_BROADCAST_ID && (RX24_STATUS_RETURN_MODE == RX24_STATUS_RETURN_ALWAYS || inst.type == INST_PING || (RX24_STATUS_RETURN_MODE == RX24_STATUS_RETURN_ONREAD && inst.type == INST_READ)))

/*************************************************************************************/
/** Fonctions gérant l'envoi de paquet instruction par l'intermédiaire du buffer    **/
/*************************************************************************************/

#if RX24_STATUS_RETURN_MODE != RX24_STATUS_RETURN_NEVER
static bool_e RX24_instruction_async_read(Uint8 id_servo, Uint8 address, Uint8 length) {
	RX24_instruction_packet_t inst = {0};

	inst.id_servo = id_servo;
	inst.type = INST_READ;
	inst.address = address;
	inst.param_1 = length;
	inst.size = MIN_INSTRUCTION_PACKET_SIZE + 2;

