samuelpoiraud/robot/STM32/QS/QS_rx24.c
	return RX24_instruction_queue_insert(&inst);
}
#endif

static bool_e RX24_instruction_async_write8(Uint8 id_servo, Uint8 address, Uint8 value) {
	RX24_instruction_packet_t inst = {0};

	if((Uint16)value > RX24_decode_value_range(address, TRUE))
		value = RX24_decode_value_range(address, TRUE);

	if((Uint16)value < RX24_decode_value_range(address, FALSE))
		value = RX24_decode_value_range(address, FALSE);

	inst.id_servo = id_servo;
	inst.type = INST_WRITE;
	inst.address = address;
	inst.param_1 = value;
	inst.size = MIN_INSTRUCTION_PACKET_SIZE + 2;

	return RX24_instruction_queue_insert(&inst);
}

static bool_e RX24_instruction_async_write16(Uint8 id_servo, Uint8 address, Uint16 value) {
	RX24_instruction_packet_t inst = {0};

	if(value > RX24_decode_value_range(address, TRUE))
		value = RX24_decode_value_range(address, TRUE);

	if(value < RX24_decode_value_range(address, FALSE))
		value = RX24_decode_value_range(address, FALSE);

	inst.id_servo = id_servo;
	inst.type = INST_WRITE;
	inst.address = address;
	inst.param = value;
	inst.size = MIN_INSTRUCTION_PACKET_SIZE + 3;	//param is 16bits

	return RX24_instruction_queue_insert(&inst);
}

static bool_e RX24_instruction_async_ping(Uint8 id_servo) {
	RX24_instruction_packet_t inst = {0};

	inst.id_servo = id_servo;
	inst.type = INST_PING;
	inst.size = MIN_INSTRUCTION_PACKET_SIZE;

	return RX24_instruction_queue_insert(&inst);
}

static bool_e RX24_instruction_async_prepare_write8(Uint8 id_servo, Uint8 address, Uint8 value) {
	RX24_instruction_packet_t inst = {0};

	if((Uint16)value > RX24_decode_value_range(address, TRUE))
		value = RX24_decode_value_range(address, TRUE);

	if((Uint16)value < RX24_decode_value_range(address, FALSE))
		value = RX24_decode_value_range(address, FALSE);

	inst.id_servo = id_servo;
	inst.type = INST_REG_WRITE;
	inst.address = address;
	inst.param_1 = value;
	inst.size = MIN_INSTRUCTION_PACKET_SIZE + 2;

	return RX24_instruction_queue_insert(&inst);
}

static bool_e RX24_instruction_async_prepare_write16(Uint8 id_servo, Uint8 address, Uint16 value) {
	RX24_instruction_packet_t inst = {0};

	if(value > RX24_decode_value_range(address, TRUE))
		value = RX24_decode_value_range(address, TRUE);

	if(value < RX24_decode_value_range(address, FALSE))
		value = RX24_decode_value_range(address, FALSE);

	inst.id_servo = id_servo;
	inst.type = INST_REG_WRITE;
	inst.address = address;
	inst.param = value;
	inst.size = MIN_INSTRUCTION_PACKET_SIZE + 3;	//param is 16bits

	return RX24_instruction_queue_insert(&inst);
}

static bool_e RX24_instruction_async_execute_write() {
	RX24_instruction_packet_t inst = {0};

	inst.id_servo = RX24_BROADCAST_ID;
	inst.type = INST_ACTION;
	inst.size = MIN_INSTRUCTION_PACKET_SIZE;

	return RX24_instruction_queue_insert(&inst);
}

#if RX24_STATUS_RETURN_MODE != RX24_STATUS_RETURN_NEVER
static Uint8 RX24_instruction_read8(Uint8 id_servo, Uint8 address, bool_e *isOk) {
	if(!RX24_instruction_async_read(id_servo, address, 1)) {
		if(isOk) *isOk = FALSE;
		return 0;
	}

	if(!RX24_instruction_wait(id_servo)) {
		if(isOk) *isOk = FALSE;
		return 0;
	}

	if(isOk) *isOk = TRUE;
	return RX24_instruction_get_last_status(id_servo).param_1;
}

static Uint16 RX24_instruction_read16(Uint8 id_servo, Uint8 address, bool_e *isOk) {
	if(!RX24_instruction_async_read(id_servo, address, 2)) {
		if(isOk) *isOk = FALSE;
		return 0;
	}

	if(!RX24_instruction_wait(id_servo)) {
		if(isOk) *isOk = FALSE;
		return 0;
	}

	if(isOk) *isOk = TRUE;
	return RX24_instruction_get_last_status(id_servo).param;
}
#endif

static bool_e RX24_instruction_write8(Uint8 id_servo, Uint8 address, Uint8 value) {
	if(RX24_prepare_commands) {
		if(!RX24_instruction_async_prepare_write8(id_servo, address, value))
			return FALSE;
	} else {
		if(!RX24_instruction_async_write8(id_servo, address, value))
			return FALSE;
	}

	#if RX24_STATUS_RETURN_MODE == RX24_STATUS_RETURN_ALWAYS
		if(id_servo == RX24_BROADCAST_ID)
			return TRUE;
		if(!RX24_instruction_wait(id_servo))
			return FALSE;
		return RX24_instruction_get_last_status(id_servo).error == RX24_ERROR_OK;
	#endif

	return TRUE;
}

static bool_e RX24_instruction_write16(Uint8 id_servo, Uint8 address, Uint16 value) {
	if(RX24_prepare_commands) {
		if(!RX24_instruction_async_prepare_write16(id_servo, address, value))
			return FALSE;
	} else {
		if(!RX24_instruction_async_write16(id_servo, address, value))
			return FALSE;
	}

	#if RX24_STATUS_RETURN_MODE == RX24_STATUS_RETURN_ALWAYS
		if(id_servo == RX24_BROADCAST_ID)
			return TRUE;
		if(!RX24_instruction_wait(id_servo))
			return FALSE;
		return RX24_instruction_get_last_status(id_servo).error == RX24_ERROR_OK;
	#endif

	return TRUE;
}

static bool_e RX24_instruction_ping(Uint8 id_servo) {
	RX24_instruction_packet_t inst = {0};

	inst.id_servo = id_servo;
	inst.type = INST_PING;
	inst.size = MIN_INSTRUCTION_PACKET_SIZE;

	if(!RX24_instruction_queue_insert(&inst))
		return FALSE;

	if(!RX24_instruction_wait(id_servo))
		return FALSE;

	return (RX24_instruction_get_last_status(id_servo).error & RX24_ERROR_TIMEOUT) == 0;
}

static bool_e RX24_instruction_buffer_is_full() {
	return RX24_instruction_queue_is_full();
}

static void RX24_instruction_next(Uint16 error, Uint16 param) {
	RX24_on_the_robot[state_machine.current_instruction.id_servo].last_status.error = error;
	RX24_on_the_robot[state_machine.current_instruction.id_servo].last_status.param = param;
	if(state_machine.current_instruction.type == INST_PING)
		RX24_on_the_robot[state_machine.current_instruction.id_servo].last_status.last_instruction_address = RX24_PING;
	else
		RX24_on_the_robot[state_machine.current_instruction.id_servo].last_status.last_instruction_address = state_machine.current_instruction.address;
	RX24_instruction_queue_next();
}

static bool_e RX24_instruction_wait(Uint8 id_servo) {
	Uint32 i = 0;
	//debug_printf("+1\n");
	while(!RX24_instruction_queue_is_empty() && i < 65000000)	//si i atteint 65000, on stop, on a attendu trop longtemps (au moins 6,5ms à une clock de 10Mhz, mais ce bout de code ne fait qu'une instruction)
		i++;

	if(i < 65000000) return TRUE;

	debug_printf("RX24 Wait too long %d / %d\n", RX24_special_instruction_buffer.start_index, RX24_special_instruction_buffer.end_index);
	RX24_on_the_robot[id_servo].last_status.error = RX24_ERROR_TIMEOUT | RX24_ERROR_RANGE;	//On a attendu trop longtemps, le buffer est toujours plein
	RX24_on_the_robot[id_servo].last_status.param = 0;
	return FALSE;
}

static RX24_status_t RX24_instruction_get_last_status(Uint8 id_servo)
{
	RX24_status_t status;
	RX24_UART_DisableIRQ();
	TIMER_SRC_TIMER_DisableIT();
		status = RX24_on_the_robot[id_servo].last_status;
	TIMER_SRC_TIMER_EnableIT();
	RX24_UART_EnableIRQ();

