samuelpoiraud/robot/STM32/QS/QS_rx24.c
	return status;
}

static void RX24_instruction_reset_last_status(Uint8 id_servo) {
	RX24_UART_DisableIRQ();
	TIMER_SRC_TIMER_DisableIT();
		RX24_on_the_robot[id_servo].last_status.last_instruction_address = 0;
		RX24_on_the_robot[id_servo].last_status.error = RX24_ERROR_OK;
		RX24_on_the_robot[id_servo].last_status.param = 0;
	TIMER_SRC_TIMER_EnableIT();
	RX24_UART_EnableIRQ();
}

/*****************************************************************************/
/** Fonctions internes pour la gestion des paquets et les limites de valeur **/
/*****************************************************************************/

static inline Uint16 RX24_decode_value_range(Uint8 mem_addr, bool_e get_max) {
	if(mem_addr >= RX24_MEM_SIZE) return 0;

	if(!get_max) {
		switch(RX24_values_ranges[mem_addr] & 0x0F) {
			case RX24_MIN_VALUE_0:  return 0;
			case RX24_MIN_VALUE_1:  return 1;
			case RX24_MIN_VALUE_34: return 34;
			case RX24_MIN_VALUE_50: return 50;
		}
	} else {
		switch(RX24_values_ranges[mem_addr] & 0xF0) {
			case RX24_MAX_VALUE_1023: return 1023;
			case RX24_MAX_VALUE_254:  return 254;
			case RX24_MAX_VALUE_253:  return 253;
			case RX24_MAX_VALUE_250:  return 250;
			case RX24_MAX_VALUE_150:  return 150;
			case RX24_MAX_VALUE_127:  return 127;
			case RX24_MAX_VALUE_2:    return 2;
			case RX24_MAX_VALUE_1:    return 1;
		}
	}

	return 0;
}

static Uint8 RX24_instruction_packet_calc_checksum(RX24_instruction_packet_t* instruction_packet) {
	Uint8 checksum = 0;
	Uint8 packet_length = instruction_packet->size - 4;

	if(instruction_packet->size < 6)
		debug_printf("RX24: Error: in RX24_instruction_packet_calc_checksum(): paquet trop petit\n");

	//packet_length est forcément >= 2 (voir datasheet de l'RX24)
	//PAS de break, si il y a 3 paramètres (packet_length = 3 +2), on fait toutes les additions
	switch(packet_length) {
		case 5:	//3 paramètres
			checksum += instruction_packet->param_2;
			//no break;
		case 4:	//2 paramètres
			checksum += instruction_packet->param_1;
			//no break;
		case 3:	//1 paramètre
			checksum += instruction_packet->address;
			//no break;
		case 2:	//pas de paramètre
			checksum += instruction_packet->id_servo + packet_length + instruction_packet->type;
			break;

		default:
			debug_printf("RX24: Error: RX24_instruction_packet_calc_checksum(): paquet trop grand\n");
			break;
	}

	return ~checksum;
}

static Uint8 RX24_get_instruction_packet(Uint8 byte_offset, RX24_instruction_packet_t* instruction_packet) {

	if(byte_offset == instruction_packet->size - 1)	//si c'est le dernier octet, envoyer le checksum
		return RX24_instruction_packet_calc_checksum(instruction_packet);

	switch(byte_offset)
	{
		case 0:	//PAS de break, on retourne 0xFF pour les octets numéro 0 et 1
		case 1: return 0xFF;
		case 2: return instruction_packet->id_servo;
		case 3: return instruction_packet->size - 4;
		case 4: return instruction_packet->type;
		case 5:	return instruction_packet->address;
		case 6: return instruction_packet->param_1;
		case 7: return instruction_packet->param_2;

		default:
			if(byte_offset > 7)
				debug_printf("RX24: Warning: byte_offset > 7\n");
	}

	//Si on atteint cette ligne, byte_offset > 7, on retourne 0 par défaut (ça ne devrais jamais arriver)
	return 0;
}

#ifdef RX24_STATUS_RETURN_CHECK_CHECKSUM
static Uint8 RX24_status_packet_calc_checksum(RX24_status_packet_t* status_packet) {
	Uint8 checksum = 0;
	Uint8 packet_length = status_packet->size - 4;

	if(status_packet->size < 6)
		debug_printf("RX24: Error: in RX24_status_packet_calc_checksum(): paquet trop petit\n");

	//packet_length est forcément >= 2 (voir datasheet de l'RX24)
	//PAS de break, si il y a 2 paramètre, on fait toutes les additions
	switch(packet_length) {
		case 4:	//2 paramètres
			checksum += status_packet->param_2;
			//no break;
		case 3:	//1 paramètre
			checksum += status_packet->param_1;
			//no break;
		case 2:	//pas de paramètre
			checksum += status_packet->id_servo + packet_length + (status_packet->error & 0xFF);
			break;

		default:
			debug_printf("RX24: Error: RX24_status_packet_calc_checksum(): paquet trop grand\n");
	}

	return ~checksum;
}
#endif

static bool_e RX24_update_status_packet(Uint8 receive_byte, Uint8 byte_offset, RX24_status_packet_t* status_packet)
{
	//Si c'est le dernier octet, verifier le checksum si RX24_STATUS_RETURN_CHECK_CHECKSUM est defini
	if(byte_offset > 3 && byte_offset == status_packet->size - 1) {
	#ifdef RX24_STATUS_RETURN_CHECK_CHECKSUM
		if(receive_byte != RX24_status_packet_calc_checksum(status_packet)) {
			debug_printf("RX24[%d]: invalid checksum\n", status_packet->id_servo);
			return FALSE;
		} else return TRUE;
	#else
		return TRUE;
	#endif
	}

	//mise a jour de la structure instruction avec les octets reçus
	switch(byte_offset)
	{
		case 0:
			//Initialisation de a structure a des valeurs par défaut
			status_packet->id_servo = 0;
			status_packet->size = 0;
			//status_packet->error = RX24_ERROR_OK; contient IN_PROGRESS déjà
			status_packet->param = 0;

			if(receive_byte != 0xFF)
				return FALSE;
			break;

		case 1:
			if(receive_byte != 0xFF)
				return FALSE;
			break;

		case 2:
			status_packet->id_servo = receive_byte;
			break;

		case 3:
			status_packet->size = receive_byte + 4;
			break;

		case 4:
			//pour être sur de ne pas avoir le bit 7 a 1, si l'RX24/RX24 le met a 1, on met tous les bits a 1
			status_packet->error = receive_byte & 0x7F; //On enlève le IN_PROGRESS en passant
			break;

		case 5:
			status_packet->param_1 = receive_byte;
			break;

		case 6:
			status_packet->param_2 = receive_byte;
			break;

		default:
			if(byte_offset > 6)
				debug_printf("RX24: Error: RX24_update_status_packet(): trop d'octet reçu > 6\n");
	}

	return TRUE;
}

//La machine a états est appelée par les interruptions de l'UART et par le timer
static void RX24_state_machine(RX24_state_machine_event_e event) {
	static volatile int processing_state = 0;

	#if defined(VERBOSE_MODE) && defined(RX24_DEBUG_PACKETS)
		//Pour le deboggage (avec debug_printf à la fin de l'envoi/reception d'un paquet)
		static Uint8 RX24_UART2_reception_buffer[MAX_STATUS_PACKET_SIZE*2] = {0};
		Uint8 i, pos;
	#endif

//sécurisation des appels à cette fonction lorsque event == RX24_SME_NoEvent pour eviter que l'état RX24_SMS_ReadyToSend soit exécuté plusieurs fois
//si une IT arrive a un certain moment, elle sera executée complètement, donc processing_state reviendra à son état d'origine
	if(event == RX24_SME_NoEvent) {
//1) Si une IT arrive a ce moment, elle s'execute entièrement et change l'état de RX24_SMS_ReadyToSend en RX24_SMS_Sending, cet appel continuera et le switch branchera sur RX24_SMS_Sending, il n'y a rien de prévu pour RX24_SME_NoEvent donc cet appel ne fera rien au final
		if(processing_state > 0)
//2) Si une IT arrive a ce moment, elle s'executera pas, elle retournera sans rien faire car processing_state est > 0
			return;
//3) Si une IT arrive a ce moment, elle s'executera entièrement car processing_state == 0, l'état passera de RX24_SMS_ReadyToSend à RX24_SMS_Sending et cet appel de fonction ne fera rien comme au 1)
		processing_state = 1;
//4) Si une IT arrive a ce moment, elle ne s'executera pas car processing_state > 0
	} else if(event == RX24_SME_Timeout) {
		RX24_UART_DisableIRQ();
	} else if(event == RX24_SME_RxInterrupt || event == RX24_SME_TxInterruptRX24) {
		TIMER_SRC_TIMER_DisableIT();
	}

//Si une IT arrive avec event == RX24_SME_TxInterrupt, elle n'aura un effet que dans l'état RX24_SMS_Sending (et cette interruption ne devrait être lancée que après le putcUART2 dans RX24_SMS_ReadyToSend et pas dans RX24_SMS_Sending car une interruption n'est pas prioritaire sur elle-même)
//Si une IT arrive avec event == RX24_SME_RxInterrupt, elle n'aura un effet que dans l'état RX24_SMS_WaitingAnswer. Elle ne peut être lancée que si le timer n'a pas eu d'interruption et désactive l'interruption du timer

	switch(state_machine.state)
	{
		case RX24_SMS_ReadyToSend:
			if(event == RX24_SME_NoEvent)
			{
				// Choix du paquet à envoyer et début d'envoi
				if(!RX24_instruction_queue_is_empty())
					state_machine.current_instruction = RX24_instruction_queue_get_current();
				else {	//s'il n'y a rien a faire, mettre en veille la machine a état, l'UART sera donc inactif (et mettre en mode reception pour ne pas forcer la sortie dont on défini la tension, celle non relié a l'RX24)
					while(!RX24_UART_GetFlagStatus(USART_FLAG_TC));   //inifinite loop si uart pas initialisé

