samuelpoiraud/robot/STM32/QS/QS_rx24.c
					GPIO_WriteBit(RX24_DIRECTION_PORT_RX24, RX_DIRECTION);
					break;
				}

				state_machine.state = RX24_SMS_Sending;
				RX24_on_the_robot[state_machine.current_instruction.id_servo].last_status.error = RX24_ERROR_IN_PROGRESS;

#ifdef RX24_UART_Ptr
				state_machine.rx24_sending_index = 0;
#endif
				state_machine.receive_index = 0;


				#if defined(VERBOSE_MODE) && defined(RX24_DEBUG_PACKETS)
					debug_printf("RX24 Tx:");
					for(i = 0; i<state_machine.current_instruction.size; i++)
						debug_printf(" %02x", RX24_get_instruction_packet(i, &state_machine.current_instruction));
					debug_printf("\n");
				#endif


				GPIO_WriteBit(RX24_DIRECTION_PORT_RX24, TX_DIRECTION);

				TIMER_SRC_TIMER_start_ms(RX24_STATUS_SEND_TIMEOUT);	//Pour le timeout d'envoi, ne devrait pas arriver

#ifdef RX24_UART_Ptr
				state_machine.rx24_sending_index++;
#endif

				RX24_UART_putc(RX24_get_instruction_packet(0, &state_machine.current_instruction));
				RX24_UART_ITConfig(USART_IT_TXE, ENABLE);
			} /*else if(event == RX24_SME_TxInterrupt) {
				RX24_UART_ITConfig(USART_IT_TXE, DISABLE);
			}*/
		break;

		case RX24_SMS_Sending:
			if(event == RX24_SME_TxInterruptRX24)
			{
#ifdef RX24_UART_Ptr
				// rx24
				if(state_machine.rx24_sending_index < state_machine.current_instruction.size) {
					USART_SendData(RX24_UART_Ptr, RX24_get_instruction_packet(state_machine.rx24_sending_index, &state_machine.current_instruction));
					state_machine.rx24_sending_index++;
				} else
					USART_ITConfig(RX24_UART_Ptr, USART_IT_TXE, DISABLE);
#endif

//				if(state_machine.sending_index < state_machine.current_instruction.size) {
//					RX24_UART_putc(RX24_get_instruction_packet(state_machine.sending_index, &state_machine.current_instruction));
//					state_machine.sending_index++;
//				}


			if(

		#ifdef RX24_UART_Ptr
					state_machine.rx24_sending_index >= state_machine.current_instruction.size	//Le dernier paquet a été envoyé, passage en mode reception et attente de la réponse dans l'état RX24_SMS_WaitingAnswer s'il y a ou enchainement sur le prochain paquet à evnoyer (RX24_SMS_ReadyToSend)
		#endif
			)
			{
				TIMER_SRC_TIMER_stop();
				TIMER_SRC_TIMER_resetFlag();

				if(RX24_instruction_has_status_packet(state_machine.current_instruction))
				{
					#if defined(VERBOSE_MODE) && defined(RX24_DEBUG_PACKETS)
						for(i=0; i<MAX_STATUS_PACKET_SIZE*2; i++)
							RX24_UART2_reception_buffer[i] = 0;
						pos = 0;
					#endif

						//Attente de la fin de la transmition des octets
						//TRMT passe a 1 quand tout est envoyé (bit de stop inclu)
						//plus d'info ici: http://books.google.fr/books?id=ZNngQv_E0_MC&lpg=PA250&ots=_ZTiXKt-8p&hl=fr&pg=PA250
						while(!RX24_UART_GetFlagStatus(USART_FLAG_TC));


					GPIO_WriteBit(RX24_DIRECTION_PORT_RX24, RX_DIRECTION);

						//flush recv buffer
					while(RX24_UART_GetFlagStatus(USART_FLAG_ORE) || RX24_UART_GetFlagStatus(USART_FLAG_FE) || RX24_UART_GetFlagStatus(USART_FLAG_NE))
						RX24_UART_getc();

					state_machine.state = RX24_SMS_WaitingAnswer;

					TIMER_SRC_TIMER_start_ms(RX24_STATUS_RETURN_TIMEOUT);	//Pour le timeout de reception, ne devrait pas arriver
				}
				else
				{
					RX24_instruction_next(RX24_ERROR_OK, 0);
					state_machine.state = RX24_SMS_ReadyToSend;
					RX24_state_machine(RX24_SME_NoEvent);
				}
			}
			}else if(event == RX24_SME_Timeout) {
				TIMER_SRC_TIMER_stop();
				TIMER_SRC_TIMER_resetFlag();
				debug_printf("RX24[%d]: send timeout !!\n", state_machine.current_instruction.id_servo);

				RX24_instruction_next(RX24_ERROR_TIMEOUT, 1);
				state_machine.state = RX24_SMS_ReadyToSend;
				RX24_state_machine(RX24_SME_NoEvent);
			}

			if(state_machine.state != RX24_SMS_Sending)
				RX24_UART_ITConfig(USART_IT_TXE, DISABLE);
		break;

		case RX24_SMS_WaitingAnswer:
			if(event == RX24_SME_RxInterrupt)
			{
				//RX24_update_status_packet s'occupe de son initialisation et de son remplissage au fur et a mesure que les octets arrivent
				static RX24_status_packet_t status_response_packet;
				// Stockage de la réponse dans un buffer, si toute la réponse alors mise à jour des variables du driver et state = RX24_SMS_ReadyToSend avec éxécution

				if(RX24_UART_GetFlagStatus(USART_FLAG_FE) || RX24_UART_GetFlagStatus(USART_FLAG_NE)) { //ignore error bits
					RX24_UART_getc();
					break;
				}

				#if defined(VERBOSE_MODE) && defined(RX24_DEBUG_PACKETS)
				RX24_UART2_reception_buffer[pos] = RX24_UART_getc();

				if(!RX24_update_status_packet(RX24_UART2_reception_buffer[pos++], state_machine.receive_index, &status_response_packet))
				#else
				Uint8 data_byte = RX24_UART_getc();
				if(!RX24_update_status_packet(data_byte, state_machine.receive_index, &status_response_packet))
				#endif
				{
					//debug_printf("RX24: invalid packet, reinit reception\n");
					state_machine.receive_index = 0;	//si le paquet n'est pas valide, on reinitialise la lecture de paquet
					//pos = 0;
					//for(i=0; i<MAX_STATUS_PACKET_SIZE*2; i++)
					//	RX24_UART2_reception_buffer[i] = 0;
					break;
				} else {
					state_machine.receive_index++;
				}


				if(RX24_status_packet_is_full(status_response_packet, state_machine.receive_index))
				{
					TIMER_SRC_TIMER_stop();
					TIMER_SRC_TIMER_resetFlag();

					#if defined(VERBOSE_MODE) && defined(RX24_DEBUG_PACKETS)
						debug_printf("RX24 Rx:");
						for(i = 0; i<state_machine.receive_index; i++)
							debug_printf(" %02x", RX24_UART2_reception_buffer[i]);
						debug_printf("\n");
					#endif

					if(status_response_packet.id_servo != state_machine.current_instruction.id_servo || status_response_packet.id_servo >= RX24_NUMBER) {
						debug_printf("Wrong servo ID: %d instead of %d\n", status_response_packet.id_servo, state_machine.current_instruction.id_servo);

						RX24_instruction_next(RX24_ERROR_INSTRUCTION, 1);
					} else {

						#ifdef VERBOSE_MODE
							if(status_response_packet.error & RX24_ERROR_VOLTAGE)
								debug_printf("RX24[%d] Fatal: Voltage error\n", status_response_packet.id_servo);
							if(status_response_packet.error & RX24_ERROR_ANGLE)
								debug_printf("RX24[%d] Error: Angle error\n", status_response_packet.id_servo);
							if(status_response_packet.error & RX24_ERROR_OVERHEATING)
								debug_printf("RX24[%d] Fatal: Overheating error\n", status_response_packet.id_servo);
							if(status_response_packet.error & RX24_ERROR_RANGE)
								debug_printf("RX24[%d] Error: Range error\n", status_response_packet.id_servo);
							if(status_response_packet.error & RX24_ERROR_CHECKSUM)
								debug_printf("RX24[%d] Error: Checksum error\n", status_response_packet.id_servo);
							if(status_response_packet.error & RX24_ERROR_OVERLOAD)
								debug_printf("RX24[%d] Fatal: Overload error\n", status_response_packet.id_servo);
							if(status_response_packet.error & RX24_ERROR_INSTRUCTION)
								debug_printf("RX24[%d] Error: Instruction error\n", status_response_packet.id_servo);
							if(status_response_packet.error & 0x80)
								debug_printf("RX24[%d] Fatal: Unknown (0x80) error\n", status_response_packet.id_servo);
							if(status_response_packet.error)
								debug_printf("RX24[%d] Cmd: %d, addr: 0x%x, param: 0x%x\n",
										state_machine.current_instruction.id_servo,
										state_machine.current_instruction.type,
										state_machine.current_instruction.address,
										state_machine.current_instruction.param);
						#endif

