samuelpoiraud/robot/STM32/QS/QS_rx24.c
						RX24_instruction_next(status_response_packet.error, status_response_packet.param);
					}
					state_machine.state = RX24_SMS_ReadyToSend;
					RX24_state_machine(RX24_SME_NoEvent);
				}
			} else if(event == RX24_SME_Timeout) {
				TIMER_SRC_TIMER_stop();
				TIMER_SRC_TIMER_resetFlag();

				//debug_printf("RX24[%d] timeout Rx:", state_machine.current_instruction.id_servo);
				#if defined(VERBOSE_MODE) && defined(RX24_DEBUG_PACKETS)
					debug_printf("RX24[%d] timeout Rx:", state_machine.current_instruction.id_servo);
					for(i = 0; i<pos; i++)
						debug_printf(" %02x", RX24_UART2_reception_buffer[i]);
					debug_printf(", recv idx: %d\n", state_machine.receive_index);
					debug_printf(" Original cmd: Id: %02x Cmd: %02x Addr: %02x param: %04x\n", state_machine.current_instruction.id_servo, state_machine.current_instruction.type, state_machine.current_instruction.address, state_machine.current_instruction.param);
				#endif

				if(RX24_UART_GetFlagStatus(USART_FLAG_RXNE))
					debug_printf("RX24 timeout too small\n");

				RX24_instruction_next(RX24_ERROR_TIMEOUT, 0);
				state_machine.state = RX24_SMS_ReadyToSend;
				RX24_state_machine(RX24_SME_NoEvent);
			} /*else if(event == RX24_SME_TxInterrupt) {
				RX24_UART_ITConfig(USART_IT_TXE, DISABLE);
			}*/
		break;
	}

	if(event == RX24_SME_RxInterrupt || event == RX24_SME_TxInterruptRX24) {
		TIMER_SRC_TIMER_EnableIT();
	} else if(event == RX24_SME_Timeout) {
		RX24_UART_EnableIRQ();
	} else if(event == RX24_SME_NoEvent) {
		processing_state = 0;
	}
}

/*********************************************************************************/
/** Implémentation des fonctions gérant le buffer d'instruction (insertion ici) **/
/*********************************************************************************/

static bool_e RX24_instruction_queue_insert(const RX24_instruction_packet_t* inst) {	//utilisation d'un pointeur pour eviter de provoquer une copie intégrale de la structure, qui pourrait prendre du temps si elle est trop grande
	Uint16 i = 0;
	assert(inst->id_servo < RX24_NUMBER || inst->id_servo == RX24_BROADCAST_ID);
	while(RX24_instruction_queue_is_full() && i < 65000)	//boucle 65000 fois si le buffer reste full, si on atteint 65000, on échoue et retourne FALSE
		i++;

	if(i >= 65000) {
		if(inst->id_servo < RX24_NUMBER) {
			RX24_on_the_robot[inst->id_servo].last_status.error = RX24_ERROR_TIMEOUT | RX24_ERROR_RANGE;
			RX24_on_the_robot[inst->id_servo].last_status.param = 0;
		}
		debug_printf("RX24 Fatal: Instruction buffer full !\n");
		return FALSE;	//return false, on a pas réussi a insérer l'instruction, problème de priorité d'interruptions ?
	}

	RX24_on_the_robot[inst->id_servo].last_status.error = RX24_ERROR_IN_PROGRESS;
	RX24_special_instruction_buffer.buffer[RX24_special_instruction_buffer.end_index] = *inst;
	RX24_special_instruction_buffer.end_index = INC_WITH_MOD(RX24_special_instruction_buffer.end_index, RX24_INSTRUCTION_REAL_NEEDED_BUFFER_SIZE);
	//truc = state_machine.state;
	//if(truc == RX24_SMS_ReadyToSend)
		RX24_state_machine(RX24_SME_NoEvent);
	//else debug_printf("RX24 not ready, in state %d\n", truc);

	return TRUE;
}

/**************************************************************************/
/** Fonction initialisant l'UART2 utilisé pour communiquer               **/
/**************************************************************************/

/*	vitesse : 57600 bauds (modifiable: uart_speed)
	bits de donnees : 8
	parite : aucune
	bit de stop : 1
	pas de controle de flux
*/

static void RX24_UART_init_all(Uint32 uart_speed)
{
	NVIC_InitTypeDef NVIC_InitStructure;

	PORTS_uarts_init();


	NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 3;  //inférieur aux uarts mais supérieur au timers


#ifdef RX24_UART_ID
	RX24_UART_init(RX24_UART_Ptr, uart_speed);
	NVIC_InitStructure.NVIC_IRQChannel = RX24_UART_Interrupt_IRQn;
	NVIC_Init(&NVIC_InitStructure);
	debug_printf("UART %d initialized for RX24\n", RX24_UART_ID);
#endif
}

static void RX24_UART_init(USART_TypeDef* uartPtr, Uint16 baudrate) {
	USART_InitTypeDef USART_InitStructure;

	if(uartPtr == USART1)
		RCC_APB2PeriphClockCmd(RCC_APB2Periph_USART1, ENABLE);
	else if(uartPtr == USART2)
		RCC_APB1PeriphClockCmd(RCC_APB1Periph_USART2, ENABLE);
	else if(uartPtr == USART3)
		RCC_APB1PeriphClockCmd(RCC_APB1Periph_USART3, ENABLE);
	else {
		fatal_printf("UART inconnu !!! %p\n", uartPtr);
		assert(0 && "Uart inconnu");
	}

	USART_OverSampling8Cmd(uartPtr, ENABLE);

	USART_InitStructure.USART_BaudRate = baudrate;
	USART_InitStructure.USART_WordLength = USART_WordLength_8b;
	USART_InitStructure.USART_StopBits = USART_StopBits_1;
	USART_InitStructure.USART_Parity = USART_Parity_No;
	USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
	USART_InitStructure.USART_Mode = USART_Mode_Rx | USART_Mode_Tx;
	USART_Init(uartPtr, &USART_InitStructure);


	/* Enable USART */
	USART_Cmd(uartPtr, ENABLE);

	USART_ITConfig(uartPtr, USART_IT_RXNE, ENABLE);
	USART_ITConfig(uartPtr, USART_IT_TXE, DISABLE);
}

static void RX24_UART_DisableIRQ() {

#ifdef RX24_UART_Interrupt_IRQn
	NVIC_DisableIRQ(RX24_UART_Interrupt_IRQn);
#endif
}

static void RX24_UART_EnableIRQ() {

#ifdef RX24_UART_Interrupt_IRQn
	NVIC_EnableIRQ(RX24_UART_Interrupt_IRQn);
#endif
}

static void RX24_UART_putc(Uint8 c) {

#ifdef RX24_UART_Ptr
	USART_SendData(RX24_UART_Ptr, c);
#endif
}

static Uint8 RX24_UART_getc() {

#ifdef RX24_UART_Ptr
		if(USART_GetFlagStatus(RX24_UART_Ptr, USART_FLAG_RXNE))
			return USART_ReceiveData(RX24_UART_Ptr);
#endif

	return 0;
}

static bool_e RX24_UART_GetFlagStatus(Uint16 flag) {
	if(flag == USART_FLAG_TC) {
		if(

		#ifdef RX24_UART_Ptr
				USART_GetFlagStatus(RX24_UART_Ptr, flag)
		#endif
				)
			return TRUE;
	} else {
		if(

		#ifdef RX24_UART_Ptr
				USART_GetFlagStatus(RX24_UART_Ptr, flag)
		#endif
				)
			return TRUE;
	}
	return FALSE;
}

