samuelpoiraud/robot/STM32/QS/QS_rx24.c
static void RX24_UART_ITConfig(Uint16 flag, FunctionalState enable) {

#ifdef RX24_UART_Ptr
	USART_ITConfig(RX24_UART_Ptr, flag, enable);
#endif
}

/*****************************************************************************/
/** Interruptions utilisées (Reception/Envoi UART2 et timer pour le timeout **/
/*****************************************************************************/


//Attention ! Si on met a 0 le flag après avoir executé la machine a état,
//des interruptions peuvent être masquée
//(en gros il se peut qu'une interruption Tx arrive avant d'avoir terminée l'execution de la fonction,
//dans ce cas mettre le flag a 0 fait que l'interruption Tx n'est pas lancée)
//(car le caractère envoyé est envoyé plus vite que le retour de la fonction RX24_state_machine)


#ifdef RX24_UART_Interrupt
void _ISR RX24_UART_Interrupt(void)
{
	if(USART_GetITStatus(RX24_UART_Ptr, USART_IT_RXNE))
	{
		Uint8 i = 0;
		while(USART_GetFlagStatus(RX24_UART_Ptr, USART_FLAG_RXNE)) {		//On a une IT Rx pour chaque caratère reçu, donc on ne devrai pas tomber dans un cas avec 2+ char dans le buffer uart dans une IT
			if(state_machine.state != RX24_SMS_WaitingAnswer) {	//Arrive quand on allume les cartes avant la puissance ou lorsque l'on coupe la puissance avec les cartes alumées (reception d'un octet avec l'erreur FERR car l'entrée RX tombe à 0)
				USART_ReceiveData(RX24_UART_Ptr);
			} else {
				RX24_state_machine(RX24_SME_RxInterrupt);
				if(USART_GetFlagStatus(RX24_UART_Ptr, USART_FLAG_RXNE) && i > 5) {
					//debug_printf("Overinterrupt RX !\n");
					break; //force 0, on va perdre des caractères, mais c'est mieux que de boucler ici ...
				}
			}
			i++;
		}
	}
	else if(USART_GetITStatus(RX24_UART_Ptr, USART_IT_TXE))
	{
		RX24_state_machine(RX24_SME_TxInterruptRX24);
	}
}
#endif

void TIMER_SRC_TIMER_interrupt()
{
	Uint8 i = 0;

	while(RX24_UART_GetFlagStatus(USART_FLAG_RXNE)) {		//On a une IT Rx pour chaque caratère reçu, donc on ne devrai pas tomber dans un cas avec 2+ char dans le buffer uart dans une IT
		if(state_machine.state != RX24_SMS_WaitingAnswer) {	//Arrive quand on allume les cartes avant la puissance ou lorsque l'on coupe la puissance avec les cartes alumées (reception d'un octet avec l'erreur FERR car l'entrée RX tombe à 0)
			RX24_UART_getc();
		} else {
			RX24_state_machine(RX24_SME_RxInterrupt);
			if(RX24_UART_GetFlagStatus(USART_FLAG_RXNE) && i > 5) {
				debug_printf("Overinterrupt RX ! while timeout\n");
				break; //force 0, on va perdre des caractères, mais c'est mieux que de boucler ici ...
			}
		}
		i++;
	}
	RX24_state_machine(RX24_SME_Timeout);
	TIMER_SRC_TIMER_resetFlag();
}

/**************************************************************************/
/** Fonctions d'interface utilisé par l'utilisateur du driver            **/
/**************************************************************************/

/* Fonction initialisant ce Driver	                                     */

void RX24_init() {
	static bool_e initialized = FALSE;
	Uint8 i;
	if(initialized)
		return;

	initialized = TRUE;

	RX24_UART_init_all(RX24_UART_BAUDRATE);
	TIMER_SRC_TIMER_init();

	GPIO_WriteBit(RX24_DIRECTION_PORT_RX24, RX_DIRECTION);

	RX24_prepare_commands = FALSE;
	RX24_instruction_write8(RX24_BROADCAST_ID, RX24_RETURN_LEVEL, RX24_STATUS_RETURN_MODE);	//Mettre les RX24/RX24 dans le mode indiqué dans Global_config.h

	for(i=0; i<RX24_NUMBER; i++) {
		RX24_on_the_robot[i].angle_limit[0] = 0;
		RX24_on_the_robot[i].angle_limit[1] = 1023;

		RX24_on_the_robot[i].is_wheel_enabled = FALSE;
		RX24_instruction_reset_last_status(i);
	}
}

/* Fonction d'utilisation de l'RX24/RX24                                        */

//Configuration de l'RX24, perdure après mise hors tension sauf pour le verouillage de la config (lock).
//Unités:
// Angles sur 300° de 0 à 1023
// Vitesse en pourcentage de la vitesse max
// Voltage en dixième de volt (50 => 5.0V)
// Température en degrée celcius
// Pourcentage entre 0 et 100

#define RX24_MAX_ANGLE 1023

//Poucentage max: 100% (tout le monde le savait ça, mais c'est bien de le repréciser :) )
#define RX24_MAX_PERCENTAGE 100
#define RX24_1024_TO_PERCENTAGE(percentage) ((((Uint16)(percentage))*25) >> 8) // >> 8 <=> / 256, 25/256 = 100/1024
#define RX24_PERCENTAGE_TO_1024(percentage) ((((Uint16)(percentage)) << 8) / 25)

//Implementation

bool_e RX24_is_ready(Uint8 id_servo) {
	return RX24_instruction_ping(id_servo);
}

bool_e RX24_async_is_ready(Uint8 id_servo, bool_e *isReady) {
	RX24_status_t status = RX24_get_last_error(id_servo);
	if(status.error != RX24_ERROR_IN_PROGRESS) {
		if(status.last_instruction_address == RX24_PING) {
			RX24_reset_last_error(id_servo);
			if(status.error == RX24_ERROR_OK)
				*isReady = TRUE;
			else
				*isReady = FALSE;
			return TRUE;
		} else {
			RX24_instruction_async_ping(id_servo);
		}
	}


	return FALSE;
}

RX24_status_t RX24_get_last_error(Uint8 id_servo) {
	return RX24_instruction_get_last_status(id_servo);
}

void RX24_reset_last_error(Uint8 id_servo) {
	RX24_instruction_reset_last_status(id_servo);
}

bool_e RX24_is_buffer_full() {
	return RX24_instruction_buffer_is_full();
}

void RX24_start_command_block() {
	RX24_prepare_commands = TRUE;
}

void RX24_end_command_block() {
	RX24_instruction_async_execute_write();
	RX24_prepare_commands = FALSE;
}

#if RX24_STATUS_RETURN_MODE != RX24_STATUS_RETURN_NEVER
bool_e RX24_config_is_locked(Uint8 id_servo) {
	return RX24_instruction_read8(id_servo, RX24_LOCK, NULL) != 0;
}

Uint16 RX24_config_get_model_number(Uint8 id_servo) {
	return RX24_instruction_read16(id_servo, RX24_MODEL_NUMBER_L, NULL);
}

Uint8  RX24_config_get_firmware_version(Uint8 id_servo) {
	return RX24_instruction_read8(id_servo, RX24_VERSION, NULL);
}

Uint16 RX24_config_get_return_delay_time(Uint8 id_servo) {
	return ((Uint16)RX24_instruction_read8(id_servo, RX24_RETURN_DELAY_TIME, NULL)) * 2;
}

Uint16 RX24_config_get_minimal_angle(Uint8 id_servo) {
	return RX24_instruction_read16(id_servo, RX24_CW_ANGLE_LIMIT_L, NULL);
}

Uint16 RX24_config_get_maximal_angle(Uint8 id_servo) {
	return RX24_instruction_read16(id_servo, RX24_CCW_ANGLE_LIMIT_L, NULL);
}

Uint8  RX24_config_get_temperature_limit(Uint8 id_servo) {
	return RX24_instruction_read8(id_servo, RX24_LIMIT_TEMPERATURE, NULL);
}

Uint8  RX24_config_get_lowest_voltage(Uint8 id_servo) {
	return RX24_instruction_read8(id_servo, RX24_DOWN_LIMIT_VOLTAGE, NULL);
}

Uint8  RX24_config_get_highest_voltage(Uint8 id_servo) {
	return RX24_instruction_read8(id_servo, RX24_UP_LIMIT_VOLTAGE, NULL);
}

Uint8 RX24_config_get_maximum_torque(Uint8 id_servo) {
	Uint16 value;    //On ne peut pas utiliser la lecture 16bits a cause d'un bug de l'RX24 (voir https://sites.google.com/site/robotsaustralia/ax-12dynamixelinformation)
	value = RX24_instruction_read8(id_servo, RX24_MAX_TORQUE_L, NULL) | (RX24_instruction_read8(id_servo, RX24_MAX_TORQUE_H, NULL) << 8);
	return (Uint8)RX24_1024_TO_PERCENTAGE(value);
}

Uint8  RX24_config_get_status_return_mode(Uint8 id_servo) {
	return RX24_instruction_read8(id_servo, RX24_RETURN_LEVEL, NULL);
}

Uint8  RX24_config_get_error_before_led(Uint8 id_servo) {
	return RX24_instruction_read8(id_servo, RX24_ALARM_LED, NULL);
}

Uint8  RX24_config_get_error_before_shutdown(Uint8 id_servo) {
	return RX24_instruction_read8(id_servo, RX24_ALARM_SHUTDOWN, NULL);
}
#endif //RX24_STATUS_RETURN_MODE != RX24_STATUS_RETURN_NEVER

bool_e RX24_config_lock(Uint8 id_servo) {
	return RX24_instruction_write8(id_servo, RX24_LOCK, 1);
}

bool_e RX24_config_set_id(Uint8 id_servo_current, Uint8 id_servo_new){
	return RX24_instruction_write8(id_servo_current, RX24_ID, id_servo_new);
}

bool_e RX24_config_set_return_delay_time(Uint8 id_servo, Uint16 delay_us) {
	return RX24_instruction_write8(id_servo, RX24_RETURN_DELAY_TIME, (Uint8)(delay_us >> 1)); // >> 1 <=> /2
}

