samuelpoiraud/robot/STM32/QS/QS_rx24.c
bool_e RX24_config_set_minimal_angle(Uint8 id_servo, Uint16 degre) {
	if(degre > RX24_MAX_ANGLE) degre = RX24_MAX_ANGLE;
	return RX24_instruction_write16(id_servo, RX24_CW_ANGLE_LIMIT_L, degre);
}

bool_e RX24_config_set_maximal_angle(Uint8 id_servo, Uint16 degre) {
	if(degre > RX24_MAX_ANGLE) degre = RX24_MAX_ANGLE;
	if(degre == 0) degre = 1;	//Si l'utilisateur met un angle mini et maxi à 0, l'RX24/RX24 passera en mode rotation en continue, ce mode ne doit être activé que par RX24_set_wheel_mode_enabled (en passant TRUE)
	return RX24_instruction_write16(id_servo, RX24_CCW_ANGLE_LIMIT_L, degre);
}

bool_e RX24_config_set_temperature_limit(Uint8 id_servo, Uint8 temperature) {
	return RX24_instruction_write8(id_servo, RX24_LIMIT_TEMPERATURE, temperature);
}

bool_e RX24_config_set_lowest_voltage(Uint8 id_servo, Uint8 voltage) {
	return RX24_instruction_write8(id_servo, RX24_DOWN_LIMIT_VOLTAGE, voltage);
}

bool_e RX24_config_set_highest_voltage(Uint8 id_servo, Uint8 voltage) {
	return RX24_instruction_write8(id_servo, RX24_UP_LIMIT_VOLTAGE, voltage);
}

bool_e RX24_config_set_maximum_torque_percentage(Uint8 id_servo, Uint8 percentage) {
	Uint16 value = RX24_PERCENTAGE_TO_1024(percentage);
	return RX24_instruction_write16(id_servo, RX24_MAX_TORQUE_L, value);
}

bool_e RX24_config_set_status_return_mode(Uint8 id_servo, Uint8 mode) {
	return RX24_instruction_write8(id_servo, RX24_RETURN_LEVEL, mode);
}

bool_e RX24_config_set_error_before_led(Uint8 id_servo, Uint8 error_type) {
	return RX24_instruction_write8(id_servo, RX24_ALARM_LED, error_type);
}

bool_e RX24_config_set_error_before_shutdown(Uint8 id_servo, Uint8 error_type) {
	return RX24_instruction_write8(id_servo, RX24_ALARM_SHUTDOWN, error_type);
}


//RAM

bool_e RX24_is_wheel_mode_enabled(Uint8 id_servo) {
	return RX24_on_the_robot[id_servo].is_wheel_enabled;
}

#if RX24_STATUS_RETURN_MODE != RX24_STATUS_RETURN_NEVER
bool_e RX24_is_torque_enabled(Uint8 id_servo) {
	return RX24_instruction_read8(id_servo, RX24_TORQUE_ENABLE, NULL) != 0;
}

bool_e RX24_is_led_enabled(Uint8 id_servo) {
	return RX24_instruction_read8(id_servo, RX24_LED, NULL) != 0;
}

bool_e RX24_get_torque_response(Uint8 id_servo, Uint16* A, Uint16* B, Uint16* C, Uint16* D) {
	bool_e isOk;
	Uint8 CcwComplianceSlope;
	Uint8 CcwComplianceMargin;
	Uint8 CwComplianceMargin;
	Uint8 CwComplianceSlope;

	CcwComplianceSlope = RX24_instruction_read8(id_servo, RX24_CCW_COMPLIANCE_SLOPE, &isOk);
	if(!isOk) return FALSE;
	CcwComplianceMargin = RX24_instruction_read8(id_servo, RX24_CCW_COMPLIANCE_MARGIN, &isOk);
	if(!isOk) return FALSE;
	CwComplianceMargin = RX24_instruction_read8(id_servo, RX24_CW_COMPLIANCE_MARGIN, &isOk);
	if(!isOk) return FALSE;
	CwComplianceSlope = RX24_instruction_read8(id_servo, RX24_CW_COMPLIANCE_SLOPE, &isOk);
	if(!isOk) return FALSE;

	if(A) *A = CcwComplianceSlope;
	if(B) *B = CcwComplianceMargin;
	if(C) *C = CwComplianceMargin;
	if(D) *D = CwComplianceSlope;

	return TRUE;
}

Uint16 RX24_get_position(Uint8 id_servo) {
	return RX24_instruction_read16(id_servo, RX24_PRESENT_POSITION_L, NULL);
}

Sint8 RX24_get_move_to_position_speed(Uint8 id_servo) {
	bool_e isBackward;
	Uint16 speedPercentage;

	if(RX24_on_the_robot[id_servo].is_wheel_enabled) {
		debug_printf("RX24: RX24_get_move_to_position_speed while in wheel mode, use RX24_get_speed_percentage instead.\n");
		return 0;
	}

	speedPercentage = RX24_instruction_read16(id_servo, RX24_PRESENT_SPEED_L, NULL);

	isBackward = (speedPercentage & 0x400) != 0;
	speedPercentage = RX24_1024_TO_PERCENTAGE(speedPercentage & 0x3FF);
	if(isBackward)
		return -(Sint8)speedPercentage;
	return (Sint8)speedPercentage;
}

Sint8 RX24_get_speed_percentage(Uint8 id_servo) {
	bool_e isBackward;
	Uint16 speedPercentage;

	if(!RX24_on_the_robot[id_servo].is_wheel_enabled) {
		debug_printf("RX24: RX24_get_speed_percentage while not in wheel mode, use RX24_get_move_to_position_speed instead.\n");
		return 0;
	}

	speedPercentage = RX24_instruction_read16(id_servo, RX24_PRESENT_SPEED_L, NULL);

	isBackward = (speedPercentage & 0x400) != 0;
	speedPercentage = RX24_1024_TO_PERCENTAGE(speedPercentage & 0x3FF);
	if(isBackward)
		return -(Sint8)speedPercentage;
	return (Sint8)speedPercentage;
}

Uint8 RX24_get_torque_limit(Uint8 id_servo) {
	return (Uint8)RX24_1024_TO_PERCENTAGE(RX24_instruction_read16(id_servo, RX24_TORQUE_LIMIT_L, NULL));
}

Uint8 RX24_get_punch_torque_percentage(Uint8 id_servo) {
	return (Uint8)RX24_1024_TO_PERCENTAGE(RX24_instruction_read16(id_servo, RX24_PUNCH_L, NULL));
}

Sint8 RX24_get_load_percentage(Uint8 id_servo) {
	bool_e isBackward;
	Uint16 loadPercentage;

	loadPercentage = RX24_instruction_read16(id_servo, RX24_PRESENT_LOAD_L, NULL);

	isBackward = (loadPercentage & 0x400) != 0;
	loadPercentage = RX24_1024_TO_PERCENTAGE(loadPercentage & 0x3FF);
	if(isBackward)
		return -(Sint8)loadPercentage;
	return (Sint8)loadPercentage;
}

Uint8 RX24_get_voltage(Uint8 id_servo) {
	return RX24_instruction_read8(id_servo, RX24_PRESENT_VOLTAGE, NULL);
}

Uint8 RX24_get_temperature(Uint8 id_servo) {
	return RX24_instruction_read8(id_servo, RX24_PRESENT_TEMPERATURE, NULL);
}

bool_e RX24_is_instruction_prepared(Uint8 id_servo) {
	return RX24_instruction_read8(id_servo, RX24_REGISTERED_INSTRUCTION, NULL) != 0;
}

bool_e RX24_is_moving(Uint8 id_servo) {
	return RX24_instruction_read8(id_servo, RX24_MOVING, NULL) != 0;
}


bool_e RX24_set_wheel_mode_enabled(Uint8 id_servo, bool_e enabled) {
	if(enabled == RX24_on_the_robot[id_servo].is_wheel_enabled)	//mode déja défini
		return TRUE;

	if(enabled) {	//sauvegarde les angles limite défini et passe en mode wheel
		Uint16 min_angle, max_angle;

		RX24_on_the_robot[id_servo].is_wheel_enabled = TRUE;

		min_angle = RX24_config_get_minimal_angle(id_servo);
		if(RX24_get_last_error(id_servo).error)
			return FALSE;

		max_angle = RX24_config_get_maximal_angle(id_servo);
		if(RX24_get_last_error(id_servo).error)
			return FALSE;
		if(max_angle == 0) max_angle = 1;	//évite les bugs si les 2 angles limites sont à 0 (et donc qu'on était déja en mode wheel mais que le servo ne le savait pas.

