samuelpoiraud/robot/STM32/QS/QS_rx24.c
		if(!RX24_config_set_minimal_angle(id_servo, 0))
			return FALSE;
		if(!RX24_config_set_maximal_angle(id_servo, 0))
			return FALSE;

		RX24_on_the_robot[id_servo].angle_limit[0] = min_angle;
		RX24_on_the_robot[id_servo].angle_limit[1] = max_angle;

		return TRUE;
	} else {
		RX24_on_the_robot[id_servo].is_wheel_enabled = FALSE;
		if(!RX24_config_set_minimal_angle(id_servo, RX24_on_the_robot[id_servo].angle_limit[0]))
			return FALSE;
		if(!RX24_config_set_maximal_angle(id_servo, RX24_on_the_robot[id_servo].angle_limit[1]))
			return FALSE;
		return TRUE;
	}
}
#endif //RX24_STATUS_RETURN_MODE != RX24_STATUS_RETURN_NEVER

bool_e RX24_set_torque_enabled(Uint8 id_servo, bool_e enabled) {
	return RX24_instruction_write8(id_servo, RX24_TORQUE_ENABLE, enabled != 0);
}

bool_e RX24_set_led_enabled(Uint8 id_servo, bool_e enabled) {
	return RX24_instruction_write8(id_servo, RX24_LED, enabled != 0);
}

	/*
	Paramétrage de l'asservissement avec RX24_set_torque_response(A, B, C, D)
				Couple          Consigne de position
					^                   |
					|=============\     |
					|             ^\    |
	Sens anti-      |             | |   v
	  horaire     <-+-------------|-+=======+------------------->  Sens horaire
					|             | ^   ^   |             X: Erreur en position
					|             | |   |    \
					|             | |   |   ^ \===============
					v             | |   |   | ^
								  A B   0   C D

	=== : Courbe du couple en fonction de l'erreur en position
	Les points A, B, C, D sont la valeur absolue de la différence de position entre le point et la position consigne (en minute d'angle)
	Si la valeur absolue de l'erreur est plus grande que A (sens anti-horaire) ou D (sens horaire), le couple est constant quelque soit l'erreur
	Si la valeur absolue de l'erreur est entre A et B ou C et D, le couple est proportionnel à la valeur absolue de l'erreur (le courant minimal pour donner du couple est défini par les fonctions RX24_set_punch_current/RX24_get_punch_current)
	Si la valeur absolue de l'erreur est plus petite que B ou C, l'RX24/RX24 n'exerce aucun couple

	*/
bool_e RX24_set_torque_response(Uint8 id_servo, Uint16 A, Uint16 B, Uint16 C, Uint16 D) {
	Uint16 CcwComplianceSlope;
	Uint16 CcwComplianceMargin;
	Uint16 CwComplianceMargin;
	Uint16 CwComplianceSlope;

	//Limite d'angle max sinon si l'angle est trop élevé, RX24_DEGRE_TO_ANGLE pourrait renvoyer une valeur erronée a cause d'un overflow
	if(A > RX24_MAX_ANGLE)
		A = RX24_MAX_ANGLE-1;
	if(B > RX24_MAX_ANGLE)
		B = RX24_MAX_ANGLE-1;
	if(C > RX24_MAX_ANGLE)
		C = RX24_MAX_ANGLE-1;
	if(D > RX24_MAX_ANGLE)
		D = RX24_MAX_ANGLE-1;

	CcwComplianceSlope = A;
	CcwComplianceMargin = B;
	CwComplianceMargin = C;
	CwComplianceSlope = D;

	if(!RX24_instruction_async_write8(id_servo, RX24_CCW_COMPLIANCE_SLOPE, CcwComplianceSlope))   // A verifier value 16bits envoie dans une fonction 8 bits
		return FALSE;
	if(!RX24_instruction_async_write8(id_servo, RX24_CCW_COMPLIANCE_MARGIN, CcwComplianceMargin))
		return FALSE;
	if(!RX24_instruction_async_write8(id_servo, RX24_CW_COMPLIANCE_MARGIN, CwComplianceMargin))
		return FALSE;
	if(!RX24_instruction_async_write8(id_servo, RX24_CW_COMPLIANCE_SLOPE, CwComplianceSlope))
		return FALSE;

	#if RX24_STATUS_RETURN_MODE == RX24_STATUS_RETURN_ALWAYS
		if(!RX24_instruction_wait(id_servo) || RX24_instruction_get_last_status(id_servo).error == RX24_ERROR_OK)
			return FALSE;
	#endif

	return TRUE;
}

bool_e RX24_set_position(Uint8 id_servo, Uint16 angle) {
	if(angle > RX24_MAX_ANGLE) angle = RX24_MAX_ANGLE-1;
	return RX24_instruction_write16(id_servo, RX24_GOAL_POSITION_L, angle);
}

bool_e RX24_set_move_to_position_speed(Uint8 id_servo, Uint8 percentage) {
	if(RX24_on_the_robot[id_servo].is_wheel_enabled) {
		debug_printf("RX24: RX24_set_move_to_position_speed while in wheel mode, use RX24_set_speed_percentage instead.\n");
		return FALSE;
	}

	if(percentage > RX24_MAX_PERCENTAGE) percentage = RX24_MAX_PERCENTAGE;
	Uint16 realValue = RX24_PERCENTAGE_TO_1024(percentage);

	return RX24_instruction_write16(id_servo, RX24_GOAL_SPEED_L, realValue);
}

bool_e RX24_set_speed_percentage(Uint8 id_servo, Sint8 percentage) {
	bool_e isBackward;

	if(!RX24_on_the_robot[id_servo].is_wheel_enabled) {
		debug_printf("RX24: RX24_set_speed_percentage while not in wheel mode, use RX24_set_move_to_position_speed instead.\n");
		return FALSE;
	}

	isBackward = percentage < 0;
	//percentage & 0x7F: on enlève le bit de signe, isBackward << 10: ajoute 1024 si on tourne a l'envers
	percentage = percentage & 0x7F;
	if(percentage > RX24_MAX_PERCENTAGE) percentage = RX24_MAX_PERCENTAGE;
	Uint16 realValue = RX24_PERCENTAGE_TO_1024(percentage) | (((Uint16)isBackward) << 10);

	return RX24_instruction_write16(id_servo, RX24_GOAL_SPEED_L, realValue);
}

bool_e RX24_set_torque_limit(Uint8 id_servo, Uint8 percentage) {
	if(percentage > RX24_MAX_PERCENTAGE) percentage = RX24_MAX_PERCENTAGE;

	return RX24_instruction_write16(id_servo, RX24_TORQUE_LIMIT_L, RX24_PERCENTAGE_TO_1024(percentage));
}

bool_e RX24_set_punch_torque_percentage(Uint8 id_servo, Uint8 percentage) {
	if(percentage > RX24_MAX_PERCENTAGE) percentage = RX24_MAX_PERCENTAGE;
	return RX24_instruction_write16(id_servo, RX24_PUNCH_L, RX24_PERCENTAGE_TO_1024(percentage));
}

#endif /* def USE_RX24_SERVO */
